performance/system-performance.yaml
# Resources:
#   - https://www.artillery.io/docs
# Useful Commands:
#   - artillery run -o <filename>.json artillery.yaml
#   - artillery report <filename>.json
#   - artillery --help
config:
  http:
    extendedMetrics: true
    maxSockets: 10
  environments:
    minikube:
      target: 'http://localhost:3001'
      phases:
        - duration: 60
          arrivalRate: 5
          name: 'Warm-up (5 arrivals/sec)'
        - duration: 60
          rampTo: 15
          arrivalRate: 15
          name: 'Ramp-up to Sustained Load (15 arrivals/sec)'
        - duration: 600
          arrivalRate: 15
          name: 'Sustained Load (15 arrivals/sec)'
  processor: './performance.js'
scenarios:
  - name: 'Create Subscription (1)'
    flow:
      - post:
          url: '/subscription'
          headers:
            Content-Type: 'application/json'
            Distribution-Api-Key: 'notification123'
          json:
            subscriberId: '{{ $randomString() }}'
            eventType: 'monthly-newsletter'
            subscriptionType: 'user'
            data:
              deliveryMethods:
                - 'email'
                - 'call'
              email: '{{ $randomString() }}@email.com'
              phoneNumber: '+12815362118'
              timeZone: 'America/Chicago'
            filterJoin: 'and'
            filters:
              - field: 'manufacturer'
                operator: 'equals'
                dataType: 'string'
                value: 'Xbox'
    weight: 1
  - name: 'Create Subscription (2)'
    flow:
      - post:
          url: '/subscription'
          headers:
            Content-Type: 'application/json'
            Distribution-Api-Key: 'notification123'
          json:
            subscriberId: '{{ $randomString() }}'
            eventType: 'monthly-newsletter'
            subscriptionType: 'user'
            data:
              deliveryMethods:
                - 'call'
                - 'sms'
              email: '{{ $randomString() }}@email.com'
              phoneNumber: '+12815362118'
              timeZone: 'America/Chicago'
            filterJoin: 'and'
            filters:
              - field: 'manufacturer'
                operator: 'equals'
                dataType: 'string'
                value: 'Xbox'
    weight: 1
  - name: 'Update Subscription'
    flow:
      - get:
          url: '/subscription'
          capture:
            - json: '$[0].subscriberId'
              as: updateSubscriptionId
      - patch:
          url: '/subscription/monthly-newsletter/{{updateSubscriptionId}}'
          headers:
            Content-Type: 'application/json'
            Distribution-Api-Key: 'notification123'
          json:
            filters:
              - field: 'manufacturer'
                operator: 'or'
                dataType: 'array'
                value:
                  - 'Sony'
                  - 'Nintendo'
                  - 'Microsoft'
    weight: 1
  - name: 'Remove Subscription'
    flow:
      - get:
          url: '/subscription'
          capture:
            - json: '$[0].subscriberId'
              as: removeSubscriptionId
      - delete:
          url: '/subscription/monthly-newsletter/{{removeSubscriptionId}}'
          headers:
            Content-Type: 'application/json'
            Distribution-Api-Key: 'notification123'
    weight: 2
  - name: 'Distribution Event (Subscriptions)'
    flow:
      - post:
          beforeRequest: 'generateUUID'
          url: '/message'
          headers:
            Content-Type: 'application/json'
            Distribution-Api-Key: 'notification123'
          json:
            exchange: 'distribution'
            routingKey: 'distribution'
            message:
              id: '{{uuid}}'
              type: 'monthly-newsletter'
              metadata:
                languageCode: es-MX
              payload:
                manufacturer: 'Nintendo'
                consoles:
                  - 'Nintendo 64'
                  - 'GameCube'
                  - 'Wii'
                  - 'Wii U'
                  - 'Switch'
              addedAt: '2023-07-22T17:05:54.921Z'
    weight: 4
  - name: 'Distribution Event (Direct)'
    flow:
      - post:
          beforeRequest: 'generateUUID'
          url: '/message'
          headers:
            Content-Type: 'application/json'
            Distribution-Api-Key: 'notification123'
          json:
            exchange: 'distribution'
            routingKey: 'distribution'
            message:
              id: '{{uuid}}'
              type: 'monthly-newsletter'
              metadata:
                languageCode: en-US
              payload:
                manufacturer: 'Xbox'
                consoles:
                  - 'Xbox'
                  - 'Xbox 360'
                  - 'Xbox One'
                  - 'Xbox Series S/X'
              recipients:
                - deliveryMethods:
                    - 'sms'
                    - 'email'
                  email: '{{ $randomString() }}@email.com'
                  timeZone: 'Pacific/Auckland'
              addedAt: '2023-07-22T17:05:54.921Z'
    weight: 4